tutorials/dbsBiofilmPimpleFoam/3d-column/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  z1
    {
      type flowRateInletVelocity;
      volumetricFlowRate 2.615867574779715e-14;
      value uniform (0 0 0);
    }

  z0
    {
      type zeroGradient;
    }

  x1
    {
      type fixedValue;
      value uniform (0 0 0);
    }
    
  x0
    {
      type fixedValue;
      value uniform (0 0 0);
    }

  y1
    {
      type fixedValue;
      value uniform (0 0 0);
    }
    
  y0
    {
      type fixedValue;
      value uniform (0 0 0);
    }

  sphere1
    {
      type fixedValue;
      value uniform (0 0 0);
    }
    
  sphere2
    {
      type fixedValue;
      value uniform (0 0 0);
    }

  sphere3
    {
      type fixedValue;
      value uniform (0 0 0);
    }
    
  cylinder
    {
      type fixedValue;
      value uniform (0 0 0);
    }
}


// ************************************************************************* //
